In [45]:
import pandas as pd
df=pd.read_csv('titanic (1).csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [46]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [47]:
target=df.Survived

In [48]:
inputs = df.drop('Survived',axis='columns')

In [49]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [50]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [51]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [52]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [53]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [54]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [55]:
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [56]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [57]:
len(X_train)

712

In [58]:
len(X_test)

179

In [59]:
len(inputs)

891

In [60]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [61]:
model.fit(X_train,y_train)

GaussianNB()

In [62]:
model.score(X_test,y_test)

0.770949720670391

In [63]:
y_test[:10]

316    1
514    0
732    0
373    0
345    1
656    0
365    0
868    0
223    0
650    0
Name: Survived, dtype: int64

In [66]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 1, 0, 0, 0, 0, 0], dtype=int64)

In [67]:
model.predict_proba(X_test[:10])

array([[0.27399102, 0.72600898],
       [0.96497062, 0.03502938],
       [0.92748009, 0.07251991],
       [0.00258456, 0.99741544],
       [0.28343209, 0.71656791],
       [0.96765428, 0.03234572],
       [0.96758733, 0.03241267],
       [0.9680183 , 0.0319817 ],
       [0.96765428, 0.03234572],
       [0.96765428, 0.03234572]])